tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "keith/formulae"
tap "schniz/tap"
brew "ack"
brew "adns"
brew "libpng"
brew "libtiff"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "openssl@3"
brew "bandwhich"
brew "bat"
brew "boost"
brew "freetype"
brew "glib"
brew "cgdb"
brew "chkrootkit"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "cppcheck"
brew "libidn2"
brew "curl"
brew "diff-so-fancy"
brew "django-completion"
brew "docbook"
brew "docbook-xsl"
brew "dyld-headers"
brew "entr"
brew "exa"
brew "fd"
brew "openjpeg"
brew "x265"
brew "ffmpeg"
brew "fmt"
brew "fnm"
brew "fzf"
brew "gcc"
brew "gdb"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnu-getopt"
brew "gnupg"
brew "googletest"
brew "gotests"
brew "gperf"
brew "gpp"
brew "grep"
brew "pkg-config"
brew "highlight"
brew "htop"
brew "ilmbase"
brew "libde265"
brew "python@3.9"
brew "xmlto"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "libomp", link: true
brew "imagemagick"
brew "jansson"
brew "jpeg", link: true
brew "jq"
brew "jsoncpp"
brew "lazydocker"
brew "lazygit"
brew "libjson-rpc-cpp"
brew "libscrypt"
brew "llvm"
brew "luajit"
brew "markdown"
brew "mas"
brew "nasm"
brew "neofetch"
brew "neovim"
brew "netcat"
brew "nmap"
brew "node"
brew "noti"
brew "openvpn"
brew "p7zip"
brew "parallel"
brew "php"
brew "poco"
brew "proxychains-ng"
brew "python-tk@3.9"
brew "python@3.8"
brew "rapidjson"
brew "ripgrep"
brew "rkhunter"
brew "rsync"
brew "rust"
brew "shellcheck"
brew "spdlog"
brew "speedtest-cli"
brew "starship"
brew "tdlib"
brew "tldr"
brew "tmux"
brew "tor"
brew "trash"
brew "tree"
brew "vim"
brew "wdiff"
brew "wget"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "keith/formulae/dyld-shared-cache-extractor"
cask "anybar"
cask "audio-hijack"
cask "cleanshot"
cask "farrago"
cask "firefox"
cask "font-3270-nerd-font"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "hazel"
cask "imageoptim"
cask "istat-menus"
cask "jtool2"
cask "loopback"
cask "machoview"
cask "notion"
cask "paw"
cask "postman"
cask "rocket"
cask "soundsource"
cask "spotify"
cask "teamviewer"
cask "textbar"
cask "timing"
cask "vlc"
cask "vmware-fusion"
cask "webex"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Buffer", id: 1474298973
mas "Colorum", id: 1438554581
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "OneTab", id: 1540160809
mas "Pages", id: 409201541
mas "Pluralsight", id: 431748264
mas "Save to Pocket", id: 1477385213
mas "Shazam", id: 897118787
mas "Surfshark", id: 1437809329
mas "Twitter", id: 1482454543
mas "Vimari", id: 1480933944
mas "Wappalyzer - Technology profiler", id: 1520333300
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
vscode "AngaBlue.asm-formatter"
vscode "blindtiger.masm"
vscode "bmuskalla.vscode-tldr"
vscode "cschlosser.doxdocgen"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ExodiusStudios.comment-anchors"
vscode "formulahendry.auto-close-tag"
vscode "GitHub.vscode-pull-request-github"
vscode "GitLab.gitlab-workflow"
vscode "jeff-hykin.better-cpp-syntax"
vscode "KevinRose.vsc-python-indent"
vscode "lostintangent.vsls-whiteboard"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "redhat.java"
vscode "rogalmic.bash-debug"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "vscjava.vscode-java-pack"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
